Autodesk.Revit.DB.Structure.AnalyticalDirection
Specifies a direction for manipulating analytical model.

Autodesk.Revit.DB.Structure.AnalyticalDirection.Z
Change in Z direction

Autodesk.Revit.DB.Structure.AnalyticalDirection.Y
Change in Y direction

Autodesk.Revit.DB.Structure.AnalyticalDirection.X
Change in X direction

Autodesk.Revit.DB.Structure.AnalyticalDirection.Any
Any change, including vertical and horizontal.

Autodesk.Revit.DB.Structure.AnalyticalDirection.HorizontalEnd
Horizontal change, corresponding to end of Curve Driver.

Autodesk.Revit.DB.Structure.AnalyticalDirection.HorizontalStart
Horizontal change, corresponding to start of Curve Driver.

Autodesk.Revit.DB.Structure.AnalyticalDirection.Horizontal
Change in horizontal direction only (no elevation change).

Autodesk.Revit.DB.Structure.AnalyticalDirection.VerticalBottom
Vertical change, for bottom of Element's analytical model.

Autodesk.Revit.DB.Structure.AnalyticalDirection.VerticalTop
Vertical change, for top of Element's analytical model.

Autodesk.Revit.DB.Structure.AnalyticalDirection.Vertical
Change in vertical direction only.